Revit 2027 API
StructuralConnectionHandler.AddElementIds Method
 Adds element ids to the connection. All element ids in an array should be of applicable category.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddElementIds(
	IList<ElementId> elemIds
)
Public Sub AddElementIds (
	elemIds As IList(Of ElementId)
)
public:
void AddElementIds(
	IList<ElementId^>^ elemIds
)
member AddElementIds :
        elemIds : IList<ElementId> -> unit
Parameters
elemIds IList<ElementId>
 The ElementIdArr containing ids of elements to be added.
Exceptions
Exception | Condition
ArgumentException |  One or more element ids was not permitted to be add to the connection. Elements should be of applicable category. -or- One or more element ids was not permitted to be added to the connection. Elements should not be duplicated.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace